chapters/linux.org
# -*- org-link-file-path-type: relative; -*-
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Linux
#+date: <2023-02-06 Mon>
#+author: Britt Anderson
#+email: britt@uwaterloo.ca
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.2 (Org mode 9.6-pre)
#+bibliography: /home/britt/gitRepos/Intro2Computing4Psychology/chapters/i2c4p.bib
#+cite_export: csl assets/chicago-note-bibliography-16th-edition.csl

** Goals and Objectives
Scientific computing moves in advance of consumer adoption. To be able to take full advantage of your computer as a research tool you may need to install software or applications that require new tools or techniques or that are not /user friendly./ In fact, the main consumer operating systems: Windows and OSX may not meet your needs out-of-the-box. By installing and using Linux you will learn and practice installing software that should prepare you for the day when you need some program or some computational tool that is not available through an app store. Or when you need to figure out how to do something completely novel with your machine. 

** Installing Linux to Your Own Computer
There are a few different methods for getting Linux to run on your computer. All of them pose challenges. Any of the are acceptable, *but I will recommend using a virtual machine* [fn:1]. The other methods are summarized here, and you are welcome to try them if you wish. They will work just fine. But they are also methods that require a bit more patience, benfit from some experience, or involve a greater risk of data loss.

I will summarize the different approaches for installing the Linux operating system (OS) to your computer below, and then follow with more specific instructions.

*** Linux Only
When you do this you will irrevocably erase everything on your computer's hard disk and you will *only* have linux. This is the easiest method *if* you have a laptop accessible that you do not need for another purpose. With all the computers we have all bought over the years this is not so far fetched. Even a ten year old laptop will probably be just fine.  One of the computers I used to develop this course dates from 2011 (Lenovo X220T).

*** Dual Boot
   With this set up you have more than one operating system. You can use your usual Windows or Mac operating system, but you can also opt to use the Linux system you installed.
   If you have a Windows laptop this is not particularly hard to get working, but there is some risk when you /partition/ your hard drive. You will need be pay close attention to that step.

   If you have an older Mac with the Intel chip this is also not too hard. The same cautions apply and you will need to follow slightly different directions.

   If you have a Mac with an M1 or M2 chip this is not advised at this time (Spring 2023). There is active work porting the Linux operating system to the newer Mac hardware, but is it still a bit early for the novice user in my opinion. You can track progress of the [[https://asahilinux.org/][Asahi Linux]] project if you are interested in this. 

   Contact me if you want to try this method and I will point you to some example instructions.
   
*** Run from a USB (or SD card or external hard drive) *DEPRECATED*
This is the method that does the least to your laptop and so there is the least risk of data loss. It is also the *hardest*, most technically demanding, and has the highest concentration of black magic (where you will be typing incantations you don't understand just to make things work). Thus I call this method "deprecated." If you are adventurous, have some spare time, or just curious feel free to give it a go, but for most of you I think the Virtual Machine method will be just as safe and technically easier.

Most of the Linux distributions have a "live" version that can be run from a USB, but those live versions do not allow persistent data. That means anything you write or download will be lost when you power down. It is fine therefore to try out a new distribution of linux to see if you like the look and feel, but not ideal if you want to do work. Also, since USB and SD cards were not made with the intention of being used daily as the host of the operating system they are more prone to catastrophic failure where the card gets corrupted and you lose all your saved files. Your computer will be fine, but not the data that you have saved only to the USB or SD card.

If you want to try this method you will want a new USB, and you should ask me to point you to directions. I have them in an older branch of this course, but they are not linked here to decrease the risk of someone accidentally trying an old or outdated method or using the Mac method when the need the Windows version or vice versa. 

*** Install Linux As A Virtual Machine

    This is the  method I prefer as of Spring 2023. There are a number of videos for Mac and Windows users on how to do this on the Internet. Pay careful attention to the dates. Things are changing rapidly in this space and what worked even just last year may not work well now. Note *the rules are different depending on whether you are using an M1/M2 mac or an Intel mac* or a Window machine. Don't know which you have? Well, find out. A good workman knows their tools.

    *IMPORTANT* For all these methods and regardless of your machine make sure you have fully update Windows or OSX to the latest available version. This means Windows 11 where possible and Ventura (13) on Macs. You also need free disk space. I recommend 64gb, but 32gb is a minimum. Check the free space on your computer's hard disk before starting (not how much one-drive or icloud space you have). If you do not have enough space, then you will need to make some by uninstalling old programs you never use, and deleting those video and music files you have backed-up elsewhere and never listen to. 
    
