book/linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-17 Fri 15:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linux</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9536345">0.1. Goals and Objectives</a></li>
<li><a href="#orgd40070e">0.2. Installing Linux to Your Own Computer</a>
<ul>
<li><a href="#orgffca181">0.2.1. Linux Only</a></li>
<li><a href="#orgf6959bf">0.2.2. Dual Boot</a></li>
<li><a href="#org7211dc3">0.2.3. Run from a USB (or SD card or external hard drive) <b>DEPRECATED</b></a></li>
<li><a href="#org46547c2">0.2.4. Install Linux As A Virtual Machine</a></li>
</ul>
</li>
<li><a href="#org6f1569b">0.3. Xubuntu Walkthrough</a></li>
<li><a href="#orgc40ec1f">0.4. Package Management</a></li>
</ul>
</li>
<li><a href="#orge6e9d62">1. Assessments</a>
<ul>
<li><a href="#org9e76531">1.1. Installing Linux</a>
<ul>
<li><a href="#org4ab73a7">1.1.1. Comments</a></li>
</ul>
</li>
<li><a href="#orgbba2aab">1.2. Install Emacs Package</a>
<ul>
<li><a href="#org6e05079">1.2.1. Task</a></li>
<li><a href="#orgb20aedb">1.2.2. Details</a></li>
<li><a href="#org7e29b1d">1.2.3. Comments</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9536345" class="outline-3">
<h3 id="org9536345"><span class="section-number-3">0.1.</span> Goals and Objectives</h3>
<div class="outline-text-3" id="text-0-1">
<p>
Scientific computing moves in advance of consumer adoption. To be able to take full advantage of your computer as a research tool you may need to install software or applications that require new tools or techniques or that are not <i>user friendly.</i> In fact, the main consumer operating systems: Windows and OSX may not meet your needs out-of-the-box. By installing and using Linux you will learn and practice installing software that should prepare you for the day when you need some program or some computational tool that is not available through an app store. Or when you need to figure out how to do something completely novel with your machine. 
</p>
</div>
</div>

<div id="outline-container-orgd40070e" class="outline-3">
<h3 id="orgd40070e"><span class="section-number-3">0.2.</span> Installing Linux to Your Own Computer</h3>
<div class="outline-text-3" id="text-0-2">
<p>
There are a few different methods for getting Linux to run on your computer. All of them pose challenges. Any of the are acceptable, <b>but I will recommend using a virtual machine</b>. The other methods are summarized here, and you are welcome to try them if you wish. They will work just fine. But they are also methods that require a bit more patience, benfit from some experience, and involve a greater risk of data loss.
</p>

<p>
I will summarize the different approaches for installing the Linux operating system (OS) to your computer below, and the follow with more specific instructions.
</p>
</div>

<div id="outline-container-orgffca181" class="outline-4">
<h4 id="orgffca181"><span class="section-number-4">0.2.1.</span> Linux Only</h4>
<div class="outline-text-4" id="text-0-2-1">
<p>
When you do this you will irrevocably erase everything on your computer's hard disk and you will <b>only</b> have linux. This is the easiest method <b>if</b> you have a laptop accessible that you do not need for another purpose. With all the computers we have all bought over the years this is not so far fetched. Even a ten year old laptop will probably be just fine.  One of the computers I used to develop this course dated from 2011 (Lenovo X220T).
</p>
</div>
</div>

<div id="outline-container-orgf6959bf" class="outline-4">
<h4 id="orgf6959bf"><span class="section-number-4">0.2.2.</span> Dual Boot</h4>
<div class="outline-text-4" id="text-0-2-2">
<p>
With this set up you have more than one operating system. You can use your usual Windows or Mac operating system, but you can also opt to use the Linux system you installed.
If you have a Windows laptop this is not particularly hard to get working, but there is some risk when you <i>partition</i> your hard drive. You will need be pay close attention to that step.
</p>

<p>
If you have an older Mac with the Intel chip this is also not too hard. The same cautions apply and you will need to follow slightly different directions.
</p>

<p>
If you have a Mac with an M1 or M2 chip this is not advised at this time (Spring 2023). There is active work porting the Linux operating system to the newer Mac hardware, but is it still a bit early for the novice user in my opinion. You can track progress of the <a href="https://asahilinux.org/">Asahi Linux</a> project if you are interested in this. 
</p>

<p>
Contact me if you want to try this method and I will point you to some example instructions.
</p>
</div>
</div>

<div id="outline-container-org7211dc3" class="outline-4">
<h4 id="org7211dc3"><span class="section-number-4">0.2.3.</span> Run from a USB (or SD card or external hard drive) <b>DEPRECATED</b></h4>
<div class="outline-text-4" id="text-0-2-3">
<p>
This is the method that does the least to your laptop and so there is the least risk of data loss. It is also the <b>hardest</b>, most technically demanding, and has the highest concentration of black magic (where you will be typing incantations you don't understand just to make things work). Thus I call this method "deprecated." If you are adventurous, have some spare time, or just curious feel free to give it a go, but for most of you I think the Virtual Machine method will be just as safe and technically easier.
</p>

<p>
Most of the Linux distributions have a "live" version that can be run from a USB, bu those live versions do not allow persistent data. That means anything you write or download will be lost when you power down. It is fine therefore to try out a new distribution of linux to see if you like the look and feel, but not ideal if you want to do work. Also, since USB and SD cards were not made with the intention of being used daily as the host of the operating system they are more prone to catastrophic failure where the card gets corrupted and you lose all your saved files. Your computer will be fine, but not the data that you have saved only to the USB or SD card.
</p>

<p>
If you want to try this method you will want a new USB, and you should ask me to point you to directions. I have them in an older branch of this course, but they are not linked here to decrease the risk of someone accidentally trying an old or outdated method or using the Mac method when the need the Windows version or vice versa. 
</p>
</div>
</div>

<div id="outline-container-org46547c2" class="outline-4">
<h4 id="org46547c2"><span class="section-number-4">0.2.4.</span> Install Linux As A Virtual Machine</h4>
<div class="outline-text-4" id="text-0-2-4">
<p>
This is the  method I prefer as of Spring 2023. There are a number of videos for Mac and Windows users on how to do this on the Internet. Pay careful attention to the dates. Things are changing rapidly in this space and what worked a few years ago may not work well now. Note <b>the rules are different depending on whether you are using an M1/M2 mac or an Intel mac</b> or a Window machine. Don't know which you have? Well, find out. A good workman knows their tools.
</p>

<p>
<b>IMPORTANT</b> For all these methods and regardless of your machine make sure you have fully update Windows or OSX to the latest available version. This means Windows 11 where possible and Ventura (13) on Macs. 
</p>
</div>

<ol class="org-ol">
