chapters/linux.org
**** Windows
In order to use a virtual machine on Windows you need to make sure that the BIOS permits virtualization. Your BIOS is the basic input output system that starts up even before your operating system starts to tell your computer where to find essential start up files and to make sure that the hardware is set up to correctly use and communicate with the available software. Getting to the BIOS is generally unique to your laptop's make and model and you will have to look up how to enter the BIOS for your laptop yourself. Sometimes the default settings for Windows machines can obstruct your ability to do this. You may need to turn of Smart Boot and Quick Boot features. But try first without fiddling with those settings. 

Once you can do that the following video will show you the virtualization settings you need to enable. 

#+begin_export html
     <iframe src="https://player.vimeo.com/video/699876547?h=ff9f485432" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/699876547">Cag: Getting to the BIOS on windows (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>/
#+end_export

The tool that you need to run a virtual machine on Windows (and you can run VMs for operating systems other than Linux) requires a tool called hypervisor. This may not be on by default. The next video shows you how to make sure you have hypervisor enabled. 

#+begin_export html
<div style="padding:56.25% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/699876590?h=709cf65afc&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Cah : enabling hyper-v on windows 11 (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
#+end_export

After that you should install Ubuntu (or Xubuntu). These are two different versions of Linux which have a slightly different look and feel. Ubuntu is the more resource intensive of all the 'buntu flavors, but it is also the one with greatest user base so it is often the one with the best support and the most available information for troubleshooting problems. If you get Ubuntu working you could always create a new virtual machine for a different version of Linux later.

#+begin_export html
<iframe src="https://player.vimeo.com/video/699876560?h=e5e983d44f" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/699876560">Cai : Installing Ubuntu as a VM on Windows 11 (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export


**** MAC OSX (INTEL)
For Macintosh computer/laptops with intel based chips we can use a virtual machine software called virtual box. It is like the hypervisor described above for Windows. It is free and open and is a good choice. 

#+begin_export html
<iframe src="https://player.vimeo.com/video/699876529?h=0f778aebe5" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/699876529">Caa: Intel Mac Get Virtual Box (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export

After you have installed the software (and you really want to make sure that you have updated your machine to the latest version of the OSX operating system and that you have a reasonable amout of hard disk space available (at least 32 gigs and ideally closer to 64) you will need to create the virtual machine. It is the virtual machine that we will install Linux to.

#+begin_export html
<iframe src="https://player.vimeo.com/video/699876515?h=0e9c87982a" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/699876515">Cab: intel macs make a virtual machine with virtual box (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export

And as your final step you will install either Xubuntu or Ubuntu, and that will require getting and downloading a copy. 

#+begin_export html
<iframe src="https://player.vimeo.com/video/699876505?h=09c73a6f4b" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/699876505">Cac: you are going to need a xubuntu iso (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export

And as our final step in the process will install our linux operating system to the VM.

#+begin_export html
<iframe src="https://player.vimeo.com/video/699876484?h=d1be87592f" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/699876484">Cad: intel mac - install Xubuntu to your VM (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export

      
**** MAC OSX (ARM, ie M1 or M2)
In some ways the newer macs make things harder, in others easier. You will have many less options to get a VM going and fewer choices, at this time, for linux versions, but the method for getting a Ubuntu VM installed is quite slick, and simpler than the Intel mac.

#+begin_export html
<iframe src="https://player.vimeo.com/video/699876351?h=83652013e4" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/699876351">M1 Mac VM instructions (2022)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export

#+begin_export html
<div style="padding:65.03% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/809163584?h=84f05e0210" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/809163584">installM2VMUbuntu.mp4</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Installing a Ubuntu Virtual Machine on an M2 Mac Using UTM (2023)</p>
#+end_export

** Xubuntu Walkthrough
   When you start up your Linux desktop for the first time you may wonder what to do to get started. In the following video I show you a basic walkthrough of a first boot and I demo this on Xubuntu. The steps are similar for Ubuntu. In addition, you will hear me mention starting from a USB. This video was made when I was using that method, but you can just ignore the USB talk. It will be basically the same once you have started U(Xu)buntu on your VM. 

A couple of steps that I demonstrate is how to turn off the power management features so that your computer does not go to sleep during updates. You can always turn them back on later.

Next I illustrate updating all the software to the latest and greatest using terminal commands. We will see more about the terminal later, but you will basically type what you see in the video to get started.

   #+begin_export html
   <iframe title="vimeo-player" src="https://player.vimeo.com/video/453295883?h=a8b4a1dff6" width="640" height="360" frameborder="0" allowfullscreen></iframe>
#+end_export

