chapters/linux.org
** Package Management

Any particular program that you want to run in modern times probably requires several other pieces of software to be available on your computer. Thus, to install a program you usually have to install a /package/, which is that collection of pieces of code and their /dependencies/: the things they depend on to work. Of course, those dependencies are software too and they may also have dependencies. Some software you download and run will require downloading many pieces of software. A /package manager/ is a convenient tool to make this job easier. Different Linux distributions use different package managers. The terminal based package manager that we will be using in this course is =apt=. The course also makes extensive use of a text processing program called =emacs= and so we will download =emacs= as our first package. The steps for doing that are demonstrated in the following video. 

#+begin_export html
<iframe title="vimeo-player" src="https://player.vimeo.com/video/453295879?h=155efb04ef" width="640" height="360" frameborder="0" allowfullscreen></iframe>
#+end_export

* Assessments

** Installing Linux
  
  Demonstrate that you have installed Ubuntu to your computer. If you are one of my uwaterloo students you will do this by uploading a screen shot of your Ubuntu desktop to the Learn Dropbox. Have something open where you can type in your name and student id so that I can verify who is who. 

*** Comments
  
  There are [[https://linuxconfig.org/how-to-take-a-screenshot-on-ubuntu-20-04-focal-fossa-linux][screen capture tools]] available for your Ubuntu installation.


** Install Emacs Package 

*** Task

Demonstrate that you have a functioning Linux installation and that you can use the package management system. 

#+begin_export html
<div style="padding:65.03% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/810618916?h=aeed127e2d" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/810618916">Installing Emacs on Ubuntu 2023</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A short demo of installing emacs on a Ubuntu virtual machine (running on an M2 Mac Air)</p>
#+end_export

*** Details
  1. Open up a terminal. In Xubuntu go to the upper left of your desktop and click the icon. Type terminal in the search bar and select the top option.
  2. When the terminal opens type ~sudo apt update~ to update your list of currently available packages. This package manager works for Xubuntu, but will not be found on all Linux distributions.
  3. Type ~sudo apt install emacs~
  4. Follow the on screen instructions. When installation is complete type, in the same terminal window, ~emacs &~.
  5. Emacs will open. Use the ~File~ menu to create a new file with a sensible name in the file itself type in your name and student id and save the file as type ~.org~. Make a note of where you save it, because you will need to ...
  6. Log on to learn and submit the file. 

*** Comments
  
  If you want to try something fun open the file back up in emacs after doing the above. Then type ~C-c C-e h h~. ~C-c~ means typing the "Ctrl" key and the lower case "c" key simultaneously. The spaces between those instructions mean you have a sequence of four key chords to enter. If all goes well you have just created a web page of that file. You should be able to open it in your browser. To test, use the file browser in Xubuntu to navigate to the file with the name you used above, but now ending in ~.html~ and not the ~.org~ one. Double click and your web browser should open with that file displayed.

  To get ahead of things and learn more about the org-mode utilities you just used you can search for emacs and orgmode online. Or type ~C-h i~ to open the information functionality and navigate to the orgmode chapter.

  And if you get stressed you can always consult Emacs' built in therapist with ~M-x doctor~.

* Footnotes

[fn:1] This presents problems for us when it comes to the [[file:programming-psychology-experiments.org][Psychopy session]]. If you are using a virtual machine as recommended you will need to take a different approach to handling the psychopy assignment. If you are dual booting Linux or using a laptop running over Linux then there should be no problems.  
