book/linux.html

<div id="outline-container-orgc40ec1f" class="outline-3">
<h3 id="orgc40ec1f"><span class="section-number-3">0.4.</span> Package Management</h3>
<div class="outline-text-3" id="text-0-4">
<p>
Any particular program that you want to run in modern times probably requires several other pieces of software to be available on your computer. Thus, to install a program you usually have to install a <i>package</i>, which is that collection of pieces of code and their <i>dependencies</i>: the things they depend on to work. Of course, those dependencies are software too and they may also have dependencies. Some software you download and run will require downloading many pieces of software. A <i>package manager</i> is a convenient tool to make this job easier. Different Linux distributions use different package managers. The terminal based package manager that we will be using in this course is <code>apt</code>. The course also makes extensive use of a text processing program called <code>emacs</code> and so we will download <code>emacs</code> as our first package. The steps for doing that are demonstrated in the following video. 
</p>

<iframe title="vimeo-player" src="https://player.vimeo.com/video/453295879?h=155efb04ef" width="640" height="360" frameborder="0" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-orge6e9d62" class="outline-2">
<h2 id="orge6e9d62"><span class="section-number-2">1.</span> Assessments</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9e76531" class="outline-3">
<h3 id="org9e76531"><span class="section-number-3">1.1.</span> Installing Linux</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Demonstrate that you have installed Ubuntu to your computer. If you are one of my uwaterloo students you will do this by uploading a screen shot of your Ubuntu desktop to the Learn Dropbox. Have something open where you can type in your name and student id so that I can verify who is who. 
</p>
</div>

<div id="outline-container-org4ab73a7" class="outline-4">
<h4 id="org4ab73a7"><span class="section-number-4">1.1.1.</span> Comments</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
There are <a href="https://linuxconfig.org/how-to-take-a-screenshot-on-ubuntu-20-04-focal-fossa-linux">screen capture tools</a> available for your Ubuntu installation.
</p>
</div>
</div>
</div>


<div id="outline-container-orgbba2aab" class="outline-3">
<h3 id="orgbba2aab"><span class="section-number-3">1.2.</span> Install Emacs Package</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org6e05079" class="outline-4">
<h4 id="org6e05079"><span class="section-number-4">1.2.1.</span> Task</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Demonstrate that you have a functioning Linux installation and that you can use the package management system. 
</p>
</div>
</div>

<div id="outline-container-orgb20aedb" class="outline-4">
<h4 id="orgb20aedb"><span class="section-number-4">1.2.2.</span> Details</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>Open up a terminal. In Xubuntu go to the upper left of your desktop and click the icon. Type terminal in the search bar and select the top option.</li>
<li>When the terminal opens type <code>sudo apt update</code> to update your list of currently available packages. This package manager works for Xubuntu, but will not be found on all Linux distributions.</li>
<li>Type <code>sudo apt install emacs</code></li>
<li>Follow the on screen instructions. When installation is complete type, in the same terminal window, <code>emacs &amp;</code>.</li>
<li>Emacs will open. Use the <code>File</code> menu to create a new file with a sensible name in the file itself type in your name and student id and save the file as type <code>.org</code>. Make a note of where you save it, because you will need to &#x2026;</li>
<li>Log on to learn and submit the file.</li>
</ol>
</div>
</div>

<div id="outline-container-org7e29b1d" class="outline-4">
<h4 id="org7e29b1d"><span class="section-number-4">1.2.3.</span> Comments</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
If you want to try something fun open the file back up in emacs after doing the above. Then type <code>C-c C-e h h</code>. <code>C-c</code> means typing the "Ctrl" key and the lower case "c" key simultaneously. The spaces between those instructions mean you have a sequence of four key chords to enter. If all goes well you have just created a web page of that file. You should be able to open it in your browser. To test, use the file browser in Xubuntu to navigate to the file with the name you used above, but now ending in <code>.html</code> and not the <code>.org</code> one. Double click and your web browser should open with that file displayed.
</p>

<p>
To get ahead of things and learn more about the org-mode utilities you just used you can search for emacs and orgmode online. Or type <code>C-h i</code> to open the information functionality and navigate to the orgmode chapter.
</p>

<p>
And if you get stressed you can always consult Emacs' built in therapist with <code>M-x doctor</code>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-06 Mon 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-03-17 Fri 15:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>